item_case = {
    1: {
        "name": "Обычный кейс",
        "emoji": "🥡",
        "sell_price": 1000000
    },
    2: {
        "name": "Средний кейс",
        "emoji": "🎁",
        "sell_price": 3000000
    },
    3: {
        "name": "Ультра кейс",
        "sell_price": 5000000,
        "emoji": "☄️"
    },
    4: {
        "name": "Тайный кейс",
        "sell_price": 2000000,
        "emoji": "㊙️"
    }
}
works_items = {
    22: {
        'name': 'Камень',
        'emoji': '🪨',
        'sell_price': 15,
        'xp': 0
    },
    23: {
        "name": 'Медь',
        'emoji': '🌰',
        'sell_price': 35,
        'xp': 50,
    },
    24: {
        'name': 'Серебро',
        'emoji': '🪙',
        'sell_price': 55,
        'xp': 150
    },
    25: {
        'name': 'Золото',
        'emoji': '🌼',
        'sell_price': 100,
        'xp': 500
    },
    26: {
        'name': 'Хрусталь',
        'emoji': '🧊',
        'sell_price': 250,
        'xp': 1000
    },
    27: {
        'name': 'Плазма',
        'emoji': '🌫',
        'sell_price': 1000,
        'xp': 5000
    },
    28: {
        "name": "Шестерёнка",
        'emoji': '⚙️',
        'sell_price': 15,
        'xp': 0
    },
    29: {
        'name': 'Болтик',
        'emoji': '🔩',
        'sell_price': 35,
        'xp': 150
    },
    30: {
        'name': 'Гаечка',
        'emoji': '🔧',
        'sell_price': 100,
        'xp': 500
    },
    31: {
        'name': 'Гвоздь',
        'emoji': '🔨',
        'sell_price': 250,
        'xp': 1000
    },
    32: {
        'name': 'Отвёртка',
        'emoji': '🪛',
        'sell_price': 1000,
        'xp': 5000
    }}
items = {
    -1: {
        "name": "Деньги",
        "emoji": "💸",
        "sell_price": 1,
    },
    1: {
        "name": "Корм",
        "emoji": "🥜",
        "sell_price": 15000,
        'descriptoin': 'Корм - это магическая смесь из вкуснейших ингредиентов, которая превращает вашего любимца в настоящего супергероя!',

    },
    2: {
        "name": 'Очки',
        "emoji": "🕶️",
        "sell_price": 25000,

        'descriptoin': ' Очки - это устройство на лице, которое позволяет видеть мир яснее и резче, что иногда может быть так полезно.'
    },
    3: {
        "name": 'Кости',
        "emoji": '🦴',
        'sell_price': 10000,
        'descriptoin': 'Кости - это те самые материалы, из которых состоят скелеты животных, включая человека. '
    },
    4: {
        "name": "Конфетка",
        "emoji": '🍭',
        'sell_price': 90000,

        'descriptoin': 'Конфетка - это маленький кусочек сладости, который, казалось бы, невинное угощение, но которое способно вызвать настоящее резкое чувство вау у каждого сладкоежки. '
    },
    5: {
        "name": 'Зуб',
        'emoji': '🦷',
        'sell_price': 45000,

        'descriptoin': ' Зуб - это такой маленький кусочек кости, который живет в ротовой полости. '
    },
    6: {
        "name": 'Билет в автосалон',
        'emoji': '🎟️',
        'sell_price': 500000,

        'descriptoin': 'Автомобильный мир на вашей ладони - поймайте свой билет в автосалоне и отправляйтесь навстречу приключениям!'
    },
    7: {
        "name": "Мячик",
        "emoji": '⚾',
        "sell_price": 55000,

        'descriptoin': 'Жил-был Мячик - умный и ловкий мальчик. У него были такие друзья, как Бриллиант - красивый и'
                       ' блестящий, Звёздочка - сверкающая и яркая, Пэпси и Кока-Локо - бодрые и веселые. Каждый из друзей '
                       'уважал Мячика за его ум и доброту.'
    },
    8: {
        "name": "Бриллиант",
        "emoji": "💎",
        "sell_price": 120000,

        'descriptoin': 'Но однажды Мячик потерял Ключ от своего дома. Он и его друзья искали его везде, но нигде не нашли.'
    },
    9: {
        "name": "Ключ от дома",
        'emoji': '🔑',
        "sell_price": 800000,

        'descriptoin': 'Мячик был очень печален, ведь он любил свой дом больше всего на свете. Тогда Звёздочка посоветовала использовать волшебную палочку, чтобы вернуть ключ. '
    },
    10: {
        "name": 'Волшебная палочка',
        'emoji': '🪄',
        'sell_price': 100000,

        'descriptoin': 'Но палочка не работала без Моны Лизы - таинственной красавицы, которая жила за горами.'
    },
    11: {
        "name": "Мона Лиза",
        "emoji": "🖼️",
        "sell_price": 2600000,
        'descriptoin': 'Мячик и его друзья отправились в поисках Моны Лизы. Путь был долгим и опасным. '
    },
    12: {
        'name': 'Звёздочка',
        'emoji': '⭐',
        'sell_price': 166000,
        'descriptoin': ' Но наконец они нашли ее и попросили помощи. Мона Лиза поделилась своей мудростью и подсказала друзьям способ использования волшебной палочки.'
    },
    13: {
        'name': 'Пэпси',
        'emoji': '🥤',
        'sell_price': 100,
        'descriptoin': 'Друзья вернулись домой и использовали палочку. И вдруг, появился Ключ! '
    },
    14: {
        'name': 'Кока-Льока',
        'emoji': '🍹',
        'sell_price': 2500,
        'descriptoin': 'Мячик был восхищен и благодарен своим верным друзьям и Моне Лизе, ведь они помогли ему сохранить свой дом и способствовали искренней дружбе.  И все они были счастливы вместе. Конец.'
    },
    15: {
        'name': 'Трахун',
        'emoji': '🍸',
        'sell_price': 15000,
        'descriptoin': 'Жили-были Трахун и Квас, которые всегда были голодными и любили перекусывать вместе. Однажды они зашли в ресторан и заказали крабовый салат и милкшейк. '
    },
    16: {
        'name': 'Квас',
        'emoji': '🍺',
        'sell_price': 25000,
        'descriptoin': ' Но неожиданно к ним присоединилась Какашечка, которая просила поделиться едой.'
                       '- Нет, не делимся мы с тобой, - заявил Трахун.'
    },
    17: {
        'name': 'Крабовый Салат',
        'emoji': '🥗',
        'sell_price': 50000,
        'descriptoin': '- Но ведь я тоже хочу попробовать ваш салат и милкшейк, - пожаловалась Какашечка.'
                       'Тут появился Деловой Костюм, который пригласил всех сесть за стол вместе и заказал большой набор блюд.'
    },
    18: {
        'name': 'Милкшейк',
        'emoji': '🍼',
        'sell_price': 91000,
        'descriptoin': 'Трахун и Квас были очень рады, что им предоставилась возможность попробовать так много вкусного.'
                       'Но вдруг наши герои заметили, что в зале появилась Маска - очень загадочная личность. '
    },
    19: {
        'name': 'Какашечка',
        'emoji': '💩',
        'sell_price': 1,
        'descriptoin': 'Все начали беспокоиться, кто на самом деле скрывается под этой маской и что ему нужно.'
                       'Однако Маска была очень доброй и щедрой - он предоставил всем на стол еще больше разнообразных блюд и напитков. '
    },
    20: {
        'name': 'Деловой Костюм',
        'emoji': '👔',
        'sell_price': 150000,
        'descriptoin': 'Трахун, Квас, Какашечка и Деловой Костюм были удивлены и очень благодарны. Они узнали, что иногда люди, которых они считали недругами, могут оказаться настоящими друзьями, если им дать шанс.'
    },
    21: {
        'name': 'Маска',
        'emoji': '🎭',
        'sell_price': 100000,
        'descriptoin': 'Так закончилась наша история о Трахуне, Квасе, Крабовом Салате, Милкшейке, Какашечке, Деловом Костюме и Маске, которая напоминает, что каждый человек может принести что-то новое и полезное в нашу жизнь.'
    }
}
