water_build = {
    1: {
        'name': '💧 Водонапорная башня',
        'price': 100000,
        'get': 20,
        'work_place': 10,
    },
    2: {
        'name': '💧 Водонасосная станция',
        'price': 200000,
        'get': 100,
        'work_place': 25,
    },

}
energy_build = {
    1: {
        'name': '💨 Ветряная электростанция',
        'price': 250000,
        'get': 100,
        'work_place': 15,
    },
    2: {
        'name': '💨 Улучшенная ветряная электростанция ',
        'price': 300000,
        'get': 500,
        'work_place': 45,
    },

}
house_build = {
    1: {
        'name': '🏡 Деревянный дом ',
        'price': 250000,
        'capacity': 100,
    },
    2: {
        'name': '🏡 Деревянный огромный дом',
        'price': 300000,
        'capacity': 250,
    },

}
